Tekla.Structures.Dialog.UIControls.SaveLoad.HelpFileTypeEnum
The help file types.

Tekla.Structures.Dialog.UIControls.SaveLoad.HelpFileTypeEnum.General
The general help file; help.chm.

Tekla.Structures.Dialog.UIControls.SaveLoad.HelpFileTypeEnum.UserDefined
The user defined help file.